
import PolicyGroup from "@/components/main/privacy/PolicyGroup";
import PageHeader from "@/components/shared/PageHeader";
import { Metadata } from "next";

export const metadata = {
    title: 'سياسة الخصوصية',
    description: 'تعرف على كيفية تعامل مراسل جدة العقاري مع بياناتك الشخصية، والتزامنا الكامل بحمايتها واحترام خصوصيتك.',
};


const PrivacyGroups = [
    [
        {
            title: 'سياسة الحجز',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
        {
            title: 'سياسة الإلغاء',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
        {
            title: 'سياسة تغيير التاريخ',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
        {
            title: 'الشروط والأحكام',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
    ],
    [
        {
            title: 'سياسة الدفع',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
        {
            title: 'سياسة الاسترداد',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
        {
            title: 'سياسة المسؤولية',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
        {
            title: 'التعديلات على السياسة',
            items: [
                'ابدأ يومك بغداء لذيذ وإطلالة جميلة من غرفتك.',
                'التعامل مع التهور بكل حذر..',
                'تم تقديم المساعدة بشكل أساسي من دون خجل. الضحك والمقترحات كانت جزءًا من التجربة.',
            ],
        },
    ],
];

export default function PrivacyPage() {
    return (
        <div className="bg-bg-2">
            <PageHeader title="سياسة الخصوصية" description="نحن نحترم خصوصيتك وملتزمون بحماية بياناتك الشخصية." />
            <div className="bg-bg-2 relative before:absolute before:w-full before:h-[150px] before:top-0 before:left-0 before:bg-dark">
                <div className="container px-3 relative z-[1] lg:mb-[60px]">
                    {PrivacyGroups.map((group, idx) => (
                        <PolicyGroup key={idx} policies={group} />
                    ))}
                </div>
            </div>
        </div>
    );
}